app/views/posts/index.html.erb

<% @user.posts.each do |p| %>
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 29], ["id", 2]]