app/controllers/posts_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 30]]
---
	def index
		# @ is an instance variable, we do this to pass it to the controller
		@user = User.find(params[:user_id])

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
	def destroy
		@post = Post.find(params[:id])
		if @post.destroy

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 29]]
INSERT INTO "posts" ("created_at", "post_text", "post_title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-08-03 16:46:00.334267"], ["post_text", "SO many syntax errors!"], ["post_title", "Plural vs. Singular?"], ["updated_at", "2014-08-03 16:46:00.334267"]]
---
	def create
		@user = User.find(params[:user_id])
		@post = @user.posts.new(params[:id])
		if @post.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 29]]
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
 	def edit
 		@user = User.find(params[:user_id])
 		@post = Post.find(params[:id])

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 29]]
UPDATE "posts" SET "post_text" = ?, "post_title" = ?, "updated_at" = ? WHERE "posts"."id" = 12  [["post_text", "I think it did"], ["post_title", "Does this work"], ["updated_at", "2014-08-12 19:00:33.005875"]]
---
 	def update
 		@post = Post.find(params[:id])
 		@user = User.find(params[:user_id])
 		if @post.update(post_params)