app/controllers/private_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 29]]
---
	 def index
	 	if @user = User.find(session[:user_id])