app/controllers/users_controller.rb

	def index
		# @ is an instance variable, we do this to pass it to the controller
		@users = User.all
---
SELECT "users".* FROM "users"

	def show
		@id = params[:id]
		@user = User.find(@id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

	def destroy
		u = User.find(params[:id])
		if u.destroy
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 20]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 20]]

	def create
		@user = User.new(params[:user])
		if @user.save
---
INSERT INTO "users" ("created_at", "email", "fname", "lname", "password", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-07-24 23:45:30.772539"], ["email", "mom@gmail.com"], ["fname", "Michel"], ["lname", "Salazar"], ["password", "bodhi"], ["updated_at", "2014-07-24 23:45:30.772539"]]

 	def update
 		 user = User.find(params[:id])
 		if user.update(params[:user])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 17]]
UPDATE "users" SET "fname" = ?, "lname" = ?, "updated_at" = ? WHERE "users"."id" = 16  [["fname", "Crosby"], ["lname", "Hyler"], ["updated_at", "2014-07-23 01:22:49.131432"]]